In [28]:
import pandas as pd
import matplotlib.pyplot as plb
import numpy as np
from scipy.stats import skew
import seaborn as sns

In [29]:
df=pd.read_csv('C:/Users/sahil/Desktop/StudentsPerformance.csv')

In [30]:
df1 = df
df1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,NaN,57.0,44.0
4,male,group C,some college,standard,none,76.0,NaN,75.0
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88.0,99.0,95.0
996,male,group C,high school,free/reduced,none,62.0,55.0,55.0
997,female,group C,high school,free/reduced,completed,59.0,71.0,65.0
998,female,group D,some college,standard,completed,68.0,78.0,77.0
999,female,group D,some college,free/reduced,none,77.0,86.0,86.0

In [31]:
df.describe()

       math score  reading score  writing score
count  987.000000     975.000000     997.000000
mean    66.310030      69.007179      68.020060
std     14.954533      14.557997      15.202634
min      8.000000      17.000000      10.000000
25%     57.000000      59.000000      57.000000
50%     66.000000      70.000000      69.000000
75%     77.000000      79.000000      79.000000
max    100.000000     100.000000     100.000000

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   987 non-null    float64
 6   reading score                975 non-null    float64
 7   writing score                997 non-null    float64
dtypes: float64(3), object(5)
memory usage: 62.6+ KB

In [33]:
df.dtypes

gender                          object
race/ethnicity                  object
parental level of education     object
lunch                           object
test preparation course         object
math score                     float64
reading score                  float64
writing score                  float64
dtype: object

In [34]:
df.isnull().sum()

gender                          0
race/ethnicity                  0
parental level of education     0
lunch                           0
test preparation course         0
math score                     13
reading score                  25
writing score                   3
dtype: int64

In [11]:
df.size

8000

In [12]:
df.shape

(1000, 8)

In [35]:
df1=df1.interpolate()
df1.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [36]:
Q1 = df1['math score'].quantile(0.25)
Q3 = df1['math score'].quantile(0.75)

In [37]:
Q1

57.0

In [38]:
Q3

77.0

In [39]:
IQR = Q3 - Q1
IQR

20.0

In [41]:
upper=Q3+(1.5*IQR)
lower=Q1-(1.5*IQR)

In [42]:
upper

107.0

In [43]:
lower

27.0

In [44]:
final1=df1[df1['math score']< lower]

In [45]:
final1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
145,female,group C,some college,free/reduced,none,22.0,39.0,33.0
338,female,group B,some high school,free/reduced,none,24.0,38.0,27.0
466,female,group D,associate's degree,free/reduced,none,26.0,31.0,38.0
787,female,group B,some college,standard,none,19.0,38.0,32.0
842,female,group B,high school,free/reduced,completed,23.0,44.0,36.0
980,female,group B,high school,free/reduced,none,8.0,24.0,23.0

In [47]:
final2=df1[df1['math score'] > upper]
final2

Empty DataFrame
Columns: [gender, race/ethnicity, parental level of education, lunch, test preparation course, math score, reading score, writing score]
Index: []